In [1]:
import pandas as pd
import numpy as np

In [2]:
n={'A':[20,35,np.nan, np.nan, 50], 
   'B':[np.nan, 20, 30, np.nan, 50],
   'C':[12,17,np.nan,np.nan,20]}  # Creating a numpy array with missing values

In [3]:
np.nan  # Represents a missing value in numpy

nan

In [4]:
df= pd.DataFrame(n)  # Creating a DataFrame from the dictionary

In [5]:
df

      A     B     C
0  20.0   NaN  12.0
1  35.0  20.0  17.0
2   NaN  30.0   NaN
3   NaN   NaN   NaN
4  50.0  50.0  20.0

In [6]:
df.isnull()  # Checks for missing values in the DataFrame

       A      B      C
0  False   True  False
1  False  False  False
2   True  False   True
3   True   True   True
4  False  False  False

In [7]:
df.isnull().sum()  # Counts the number of missing values in each column

A    2
B    2
C    2
dtype: int64

In [8]:
df.fillna(df.max())  # Replaces missing values with the maximum value of each column

      A     B     C
0  20.0  50.0  12.0
1  35.0  20.0  17.0
2  50.0  30.0  20.0
3  50.0  50.0  20.0
4  50.0  50.0  20.0